### 字典的定义——键值对 key-value
d={"20010101":"刘备","20010102":"关羽","20010103":"张飞","20010104":"赵云"}
print(d)
print(type(d))
#字典的索引：通过键来查找值 和修改值
print(d["20010101"])
d["20010102"]="马超"
print(d)

d["20010105"]="张辽" #在对某一个key进行赋值的时候，如果这个key没有的话，就会创建一个新的键值对
print(d)

print(len(d))
print(min(d)) #20010101
print(max(d)) #20010105
# 注意此处输出的是键的最大和最小值

print("20010101" in d) #True
print("刘备" in d) #Faulse
#说明这个判断的是键  而与值无关

#------------------------------------------------------------

print(d.keys())
print(type(d.keys()))

print(d.values())
print(type(d.values()))

print(d.items())
"""
输出：
dict_keys(['20010105', '20010103', '20010102', '20010104', '20010101'])
<class 'dict_keys'>
dict_values(['张辽', '张飞', '马超', '赵云', '刘备'])
<class 'dict_values'>
dict_items([('20010105', '张辽'), ('20010103', '张飞'), ('20010102', '马超'), ('20010104', '赵云'), ('20010101', '刘备')])
"""
for i in d:
    print(i)#默认是对keys进行遍历

for i in d.values():
    print(i)

for i in d.items():
    print(i)
"""
输出的是元组
('20010102', '马超')
('20010103', '张飞')
('20010101', '刘备')
('20010104', '赵云')
('20010105', '张辽')
"""

for k,v in d.items():
    print(k,v)
"""
输出
20010101 刘备
20010104 赵云
20010103 张飞
20010105 张辽
20010102 马超
"""

print(d.get("20010101")) #刘备
print(d.get("20010106")) #None
#即对于普通索引的话，如果这个key不存在，则会报错，但是使用get则会返回none（也可以自己设设置）
print(d.get("20010106","查无此人")) #查无此人

print(d.pop("20010101")) #输出 刘备    实则使用d.pop("")就可以删除这个键值对
print(d)
print(d.pop("20010107","查无此人")) #注意！！对于pop如果不写第二个参数，且第一个keey不存在，则会产生报错，而不像get一样默认输出none

print(d.popitem())#随机去一个键值对，以元组形式返回，同时删除
print(d)
